[
  {
    "name": "TRX Vertical Push-ups",
    "description": "Set the straps at mid-length. Place one foot in both cradles and walk your body back until that leg is higher than your head. Place your other foot on the ground.\nBend your arms to lower your upper body toward the floor.\nDrive through your palms to return to the start, keeping your core tight.",
    "imageUrl": "https://homegymreview.co.uk/wp-content/uploads/exercises/11151101-Suspender-Handstand-Push-up_Upper-arms_max-scaled.jpg",
    "reps": 12,
    "duration": 0
  },
  {
    "name": "TRX Chest Fly",
    "description": "Set the straps at mid-length. Stand facing away from the anchor point, holding the handles with your palms facing each other.\nLean forward, keeping your body straight, and open your arms wide to the sides.\nBring your hands back together in front of you, engaging your chest.",
    "imageUrl": "https://liftmanual.com/wp-content/uploads/2023/04/suspender-fly.jpg",
    "reps": 12,
    "duration": 0
  },
  {
    "name": "TRX Chest Press",
    "description": "Set the straps at mid-length. Stand facing away from the anchor point, holding the handles with your palms facing down.\nLean forward, keeping your body straight, and lower your chest toward the ground.\nPush back to the starting position, engaging your chest and triceps.",
    "imageUrl": "https://liftmanual.com/wp-content/uploads/2023/04/suspension-chest-press.jpg",
    "reps": 12,
    "duration": 0
  },
  {
    "name": "TRX Hamstring Curl",
    "description": "Start by lying flat on your back on the floor, with your feet in the TRX straps. \nPosition your body so your feet are directly above your hips. Engage your core and lift your hips off the ground while pulling your heels towards your hips. \nPause when your knees are bent at a 90-degree angle. Push your heels back to the start position, maintaining your hip lift, and repeat for the programmed number of reps.",
    "imageUrl": "https://s3assets.skimble.com/assets/1207807/image_iphone.jpg",
    "reps": 0,
    "duration": 45
  }
]
